# Queries about Movies

For each of the questions in this notebook, you should create an answer using both relational algebra operators as well as sql.

This notebook has "checkers" that can help you think about your solution.  You can tell whether your answer is correct or not if you run all of the cells in order.  Running the cells out of order will lead to unpredictable results. RA then SQL.

In [1]:
import warnings
warnings.filterwarnings('ignore')

from reframe import Relation
#from sols import *

In [2]:
cast = Relation('/home/faculty/millbr02/pub/cast.csv',sep=',')
title = Relation('/home/faculty/millbr02/pub/titles.csv',sep=',')
release_date = Relation('/home/faculty/millbr02/pub/release_dates.csv',sep=',')

In [3]:
cast.query("type == 'actor' & year == 2015").\
njoin(release_date.query("country == 'Norway'")).\
project(['title','name']).sort(['name'])

                                           title                    name
1511                                  Steve Jobs             $hutter Boy
378                       Straight Outta Compton             $hutter Boy
150                                          Spy                 50 Cent
0                                       Southpaw                 50 Cent
6599                                         Joy      ?dgar (II) Ram?rez
5988                                 Point Break      ?dgar (II) Ram?rez
866                        The Last Witch Hunter   ?lafur Darri ?lafsson
2346                                  The Gunman           ?scar Foronda
7001                                        Stup       ?ystein Martinsen
362                       Straight Outta Compton      A. Russell Andrews
6879                           The Good Dinosaur            A.J. Buckley
1550                                  Steve Jobs         A.J. Friederich
3821    The SpongeBob Movie: Sponge Out of Water            A.J. Pulliam
6973                           The Peanuts Movie              A.J. Tecce
330           Mission: Impossible - Rogue Nation             A.k. Steppa
1136       The Hunger Games: Mockingjay - Part 2            AJay Collazo
2243                             Pitch Perfect 2           Aakomon Jones
2582                                         Pan             Aaran Mitra
6788                       The Night Before (II)         Aaron (II) Hill
5582  Star Wars: Episode VII - The Force Awakens      Aaron (IV) Kennedy
5021                               Run All Night      Aaron (IV) Kennedy
3617                                  Black Mass       Aaron (IV) Snyder
6383                              Irrational Man         Aaron (X) Olson
5718                                   Insurgent          Aaron Brewstar
3987                                         Max             Aaron Dozzi
1958                                       Ted 2        Aaron F. Randell
584                      Avengers: Age of Ultron        Aaron Himelstein
4406                      Hot Tub Time Machine 2          Aaron Jay Rome
4503                                       Focus          Aaron Jay Rome
5770                                   Insurgent        Aaron Kirschnick
...                                          ...                     ...
6247                              Magic Mike XXL              Zac Reffey
5512                              Jurassic World           Zach Prengler
190                                          Spy              Zach Woods
3724                                     Minions  Zachary Alexander Rice
6616              Me and Earl and the Dying Girl           Zachary Bolen
6329       The Second Best Exotic Marigold Hotel          Zachary Coffin
16                                      Southpaw     Zachary Davis Brown
4176                      Paul Blart: Mall Cop 2          Zachary Morris
2284                             Pitch Perfect 2          Zachary Probus
5514                              Jurassic World          Zachary Probus
6436                            Hitman: Agent 47          Zachary Quinto
5147                                 Hot Pursuit         Zachary Woodlee
2932                                     Ant-Man             Zack Duhame
760                                   The Intern           Zack Pearlman
3087                                Tomorrowland             Zack Roundy
5280                                The Revenant           Zaeem Mahmood
2567                                         Pan             Zak Holland
614                      Avengers: Age of Ultron             Zakk Pierce
5178       Scouts Guide to the Zombie Apocalypse            Zale Kessler
6633              Me and Earl and the Dying Girl            Zander Lyons
5801                                   Insurgent            Zane Pittman
1194       The Hunger Games: Mockingjay - Part 2            Zane Pittman
1084                               Furious Seven            Zane Pittman
4814                                    Child 44          Zdenek Barinka
4016                                         Max              Zeeko Zaki
5914      Alvin and the Chipmunks: The Road Chip              Zeeko Zaki
6576                                         Joy           Zeke Elizondo
813                        The Last Witch Hunter             Zoltan Hodi
4840                                    Child 44  Zoran (VIII) Kovacevic
192                                          Spy            Zsolt Z?goni

[6771 rows x 2 columns]

In [4]:
%load_ext sql

In [5]:
%config SqlMagic.autopandas = False

In [6]:
%sql postgresql://osmaah02:@localhost/movies

'Connected: osmaah02@movies'

In [7]:
%%sql

select title, name
from moviecast natural join release_date
where type = 'actor' and year = 2015 and country = 'Norway'
order by name
limit 10

10 rows affected.

[('Spy', '50 Cent'),
 ('Southpaw', '50 Cent'),
 ('Pitch Perfect 2', 'Aakomon Jones'),
 ('Pan', 'Aaran Mitra'),
 ('Insurgent', 'Aaron Brewstar'),
 ('Max', 'Aaron Dozzi'),
 ('Ted 2', 'Aaron F. Randell'),
 ('Avengers: Age of Ultron', 'Aaron Himelstein'),
 ('The Night Before (II)', 'Aaron (II) Hill'),
 ('Run All Night', 'Aaron (IV) Kennedy')]

# Questions Start Here

### 1. Display the title and the name where the lead actor name and character name are the same for movies in 2007

In [8]:
cast.query("n == 1 & name == character & year == 2007").project(["title", "name"])

                                    title              name
108240                          Maharadhi       Balakrishna
238307                Good Luck with That  Igor Breakenback
301632                   My Name Is Bruce    Bruce Campbell
466377             Yi daegeun, Yi daikeun      Lee Dae-Geun
1591633  The Last Lecture by Randy Pausch      Randy Pausch
1756349                         The Minis     Dennis Rodman

In [9]:
%%sql

SELECT title, name 
FROM moviecast 
WHERE name = character AND n=1 AND year = 2007;

6 rows affected.

[('Maharadhi', 'Balakrishna'),
 ('Good Luck with That', 'Igor Breakenback'),
 ('My Name Is Bruce', 'Bruce Campbell'),
 ('Yi daegeun, Yi daikeun', 'Lee Dae-Geun'),
 ('The Last Lecture by Randy Pausch', 'Randy Pausch'),
 ('The Minis', 'Dennis Rodman')]

### 2. What are the ten most common movie character names of all time from most common to least?

In [10]:
cast.query('year >= 1990 & year <= 2010').groupby('character').count('name').sort('count_name', ascending = False).project(['character']).head(10)

        character
215128    Himself
113759     Dancer
160761      Extra
485297    Student
131458     Doctor
375574      Nurse
44574   Bartender
213653    Herself
429266   Reporter
535900   Waitress

In [11]:
%%sql

SELECT character, COUNT(character) FROM moviecast 
WHERE year >= 1990 AND year <= 2010
GROUP BY character ORDER BY COUNT(character) DESC LIMIT 10;

10 rows affected.

[('Himself', 8140),
 ('Dancer', 3912),
 ('Extra', 3108),
 ('Student', 2814),
 ('Doctor', 2360),
 ('Nurse', 2321),
 ('Bartender', 2316),
 ('Herself', 2288),
 ('Reporter', 2183),
 ('Waitress', 1993)]

### 3. List the name of each actress that has played the role of Stella more than one time.

In [12]:
cast.query('character == "Stella" and type == "actress"').groupby('name').count('character').query('count_character > 1').project(['name'])

                 name
2         Abi Burgess
20          Amy Gross
121      Elise Vargas
324  Martina Tremante
327       Mary Wickes
366   Ophelia Shtruhl
383  Perla Liberatori
427   Sandra Loncaric
440      Sina Tkotsch
473  Suzanne Gonzales
511       Zoey Vargas

In [13]:
%%sql

SELECT name, COUNT(name) FROM moviecast where character = 'Stella' AND moviecast.type = 'actress'
GROUP BY name HAVING COUNT(character) > 1;

11 rows affected.

[('Suzanne Gonzales', 2),
 ('Ophelia Shtruhl', 2),
 ('Perla Liberatori', 3),
 ('Sina Tkotsch', 2),
 ('Martina Tremante', 2),
 ('Sandra Loncaric', 2),
 ('Mary Wickes', 3),
 ('Zoey Vargas', 2),
 ('Elise Vargas', 2),
 ('Abi Burgess', 2),
 ('Amy Gross', 2)]

### 4. Display all information about the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [14]:
cast.query("title == 'Sleuth' & year == 2008").sort(['n'])

Empty Relation
Columns: [title, year, name, type, character, n]
Index: []

In [15]:
%%sql

SELECT * FROM moviecast where title = 'Sleuth' AND year = 2007 ORDER BY n

7 rows affected.

[(293979, 'Sleuth', 2007, 'Michael Caine', 'actor', 'Andrew', 1.0),
 (1168226, 'Sleuth', 2007, 'Jude Law', 'actor', 'Milo', 2.0),
 (1631579, 'Sleuth', 2007, 'Harold Pinter', 'actor', 'Man on T.V.', 3.0),
 (336873, 'Sleuth', 2007, 'Alec (II) Cawthorne', 'actor', 'Inspector Doppler', None),
 (233198, 'Sleuth', 2007, 'Kenneth Branagh', 'actor', 'Other Man on T.V.', None),
 (2452309, 'Sleuth', 2007, 'Eve (II) Channing', 'actress', 'Marguerite Wyke', None),
 (3015769, 'Sleuth', 2007, "Carmel O'Sullivan", 'actress', 'Maggie', None)]

### 5. display the number of roles available to actresses for each year starting with 2000 up to 2015 order by year

In [16]:
cast.query('type == "actor" & year >= 2000 & year < 2015').groupby('year').count('name').sort('year', ascending = False).project(['year', 'count_name'])

    year  count_name
14  2014       92156
13  2013       87427
12  2012       83934
11  2011       79676
10  2010       73065
9   2009       74747
8   2008       63001
7   2007       56463
6   2006       54188
5   2005       47856
4   2004       40801
3   2003       37544
2   2002       35255
1   2001       34218
0   2000       32817

In [17]:
%%sql

SELECT year, COUNT(character) FROM moviecast 
WHERE moviecast.type = 'actor' AND year >= 2000 AND year < 2015
GROUP BY year ORDER BY year DESC;

15 rows affected.

[(2014, 92157),
 (2013, 87428),
 (2012, 83936),
 (2011, 79679),
 (2010, 73065),
 (2009, 74748),
 (2008, 63001),
 (2007, 56464),
 (2006, 54188),
 (2005, 47857),
 (2004, 40801),
 (2003, 37544),
 (2002, 35255),
 (2001, 34218),
 (2000, 32818)]